[
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "all right so this is how we're hooking up our power inverter to the main battery into the vehicle itself and the vehicle's 12-volt system once again consult your professionals to make sure that you're doing everything right for your current application and specific needs and demands however this is how I have chose to do this you need to have a fuse now fuse can be a good and a bad thing you have to have it either way but if you get these large like i have this large 60 amp fuse right here that's going to generate the most power to where i need it to go i'm using just this regular line like this i'm using the entire cord as a as a power in line but i've got each one of of those strands fused in here so the if there's ever a short or anything these will pop and prevent you know like a fire or something from happening if you don't have this and you have a huge huge chance of a fire catastr"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "g these will pop and prevent you know like a fire or something from happening if you don't have this and you have a huge huge chance of a fire catastrophe or your battery blowing up or something so I've got 260 or 230s here and then a 60 right here to allow the maximum amount of electricity to flow through but still be able to go ahead and have that safety backup in case anything happens. So for more information check out the website below. Here and today we want to talk about power inverters. A large common misconception about power inverters is that you need a great big huge power inverter to run most of the tools that you need to do. That's actually not that true. I mean, obviously there are more with more wattages, you can run larger tools and larger instruments. However, most people don't have them installed correctly to be able to utilize the maximum power out of the ones you have "
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "ols and larger instruments. However, most people don't have them installed correctly to be able to utilize the maximum power out of the ones you have here. I have here an 800 watt inverter that I used to run my lights and I have a 1500 watt inverter, which mounted now is probably how most people have it mounted to where you'd run a power cable right here from direct from the car's battery. and then you would have it grounded out to a good ground source. Now that will run most things. In fact, it will turn on, it will run some lights, it will run my key machine and the charger all at the same time. So right now, this is about, I'm driving about four and a half to five amps. It's running some LED lights, it's running battery charger over here, I can run another battery charger here and that's enough for me for most things but what I want to do is show you the difference of what you can do "
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": ", I can run another battery charger here and that's enough for me for most things but what I want to do is show you the difference of what you can do to maximize this now if we come over here we have a air conditioner and if we go ahead and turn the power on you'll notice that it's gonna cut so you can hear that and you can see it every time it tries to come on it's going to go ahead and try and shut down so what we're going to go ahead and do today is we're going to add an external battery. Let me go ahead and shut this stuff off. We're going to add an extra battery to this. So what this battery is going to do is it's going to take the shock load and provide direct power to this inverter. Now this is going to be tied in with the existing system. Basically we're just going to hook some some heavy duty cables up here. This is the number one spot where you going to be lacking and losing po"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "ystem. Basically we're just going to hook some some heavy duty cables up here. This is the number one spot where you going to be lacking and losing power is in your cables You can see how heavy duty this wire is This is some super heavy duty wire You want free flowing electricity to everything because this is what the current travels through. So we're basically going to hook this up and tie it into this unit and then we're going to mount this battery right down here. A couple things that we need to talk about with that. That's going to let me run this longer with the engine of the vehicle off, but it's also going to go ahead and allow me to use and get the most out of my power inverters. Let's talk about the battery for a second. You cannot just take a normal car battery or lead acid battery and put it and mount it inside your vehicle. You're going to release hydrogen gas, and hydrogen g"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": " just take a normal car battery or lead acid battery and put it and mount it inside your vehicle. You're going to release hydrogen gas, and hydrogen gas is going to be harmful to your body, and it's also flammable. you could cause an explosion. Basically, when you're charging your battery or you have an overcharge of your battery, it needs to release that gas and that pressure in there with the sulfuric acid. So the byproduct is going to be hydrogen gas. If you do not have a sealed battery, that will be in your car. And if you build up too much in your car, there could be an explosion and it could cause health problems. I contacted the great people over at Interstate Batteries and came up with the solution here. Now this is a lead acid battery, but as we can see on the top, it is partially sealed. Okay. And we'll go into that a little bit further. Basically what it does is it has the cap"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "ery, but as we can see on the top, it is partially sealed. Okay. And we'll go into that a little bit further. Basically what it does is it has the cap sealed off, but it vents into these tubes where I've installed these two holes right here on either side and I've installed vent tubes that we will go ahead and vent to the outside. So once we have this installed we'll have those mounted those vent tubes will go outside if there's any gas released it's going to go through there. You need to make sure that you have the correct battery for the system. They also you can purchase a 100% sealed battery unit with about, I think, between 75 and 80 amp hours for a sealed battery, a 100% sealed battery unit, you're going to be looking at about a $250 price tag. That was a little bit out of my budget for what I wanted to spend for this particular unit, as this was about $100. So, you know, way less "
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "price tag. That was a little bit out of my budget for what I wanted to spend for this particular unit, as this was about $100. So, you know, way less than half the cost. Plus, if this works out well, I may want to double up on my batteries and run two of these. So instead of looking at around a $500 system, at the most I'm going to be running about a $200 system. Okay. So make sure that you know what kind of battery you have and make sure you know that you can vent it properly. If you go with the 100% sealed units, great. More power to you. Congratulations. They're just very, very expensive for the same amount of amp hours. That's the other thing about this battery. It's not rated in cold cranking amps. It's rated in amp hours. Amp hours is going to be 70 on this, okay? So this is the battery that I got. Those are the reasons why. I actually called and talked to Interstate Batteries, the"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": " going to be 70 on this, okay? So this is the battery that I got. Those are the reasons why. I actually called and talked to Interstate Batteries, the professionals down there, and got all this information from them. So if you have any questions, you need to call and make sure that your battery with your part number is going to work for your application and what you're going to do. If you don't, you can explode yourself and poison yourself. So very very super important to make sure that you know what you're doing when it comes to this right here Make sure you call and find out first. This is the system that I came up with I gonna go ahead and vent these out and we show you how much more power we can actually get out of this this this system running like this so Follow me and we we hang out and we check it out Alrighty so now we got our battery hooked up to here We tapped into the line th"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": " running like this so Follow me and we we hang out and we check it out Alrighty so now we got our battery hooked up to here We tapped into the line that supplies both of these power inverters and we've hooked it up to the ground there. We've got our battery down here. Vent tubes go out down there, out and away from the vehicle. And let's turn this puppy on and see what she can do so we're running LED lights right now running battery charger we're running 9 amp 1200 BTU air conditioner and let's flip on the key machine to see if it'll run it beautiful absolutely beautiful so that's running you can see off on running a key machine lights battery charger an air conditioner all in one spot from a 1500 watt power inverter the reason all that's possible is because we have the battery that takes the load immediately and the vehicle system. So I'm going to shut all this off so you can hear me ta"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "ossible is because we have the battery that takes the load immediately and the vehicle system. So I'm going to shut all this off so you can hear me talk. And you can see it keeps running for a while. But yeah, so it's not really necessarily the size of the inverter that matters. It's how it's wired up, the thickness of the wire, the gauge of the wire, and what kind of batteries you have. If you have a high amp hour battery like this down here hooked up in the system, it's going to run great. And then tie it into your normal system as well. A couple of other different things you can do is you can install a, I can't remember exactly what it's called, but there's a device that you can install that will allow power to run out of your battery, your backup battery down here. But, or it will allow it to charge, but it won't allow it to drain the system. So, for example, if you leave your lights"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "our backup battery down here. But, or it will allow it to charge, but it won't allow it to drain the system. So, for example, if you leave your lights on all night, you're going to have two dead batteries now. Not just one, you're going to have two. And jumping, that's going to be kind of a difficult thing to do. So, if you have that power cutter, you know, you would find those at a place that supplies winches or, you know, off-road supplies, something like that. you can run that system in there I choose not to for right now we'll see how it works I may add one later but I do not need to at this time but again the main thing is 1500 watt power inverter can run lights an air conditioner and a key machine no problem we don't need a bigger power inverter we just need to wire the one that we have currently this stuff all day long so for more information check out the website below all right "
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "er inverter we just need to wire the one that we have currently this stuff all day long so for more information check out the website below all right so we're back here 1500 watt power inverter we've got our negative contact for our uh double our double dual battery system here um and i just want to give you one more example on why on how this system works uh so much better if you have a battery that is directly contacted with the uh power inverter to go ahead and take that shock load. And what right now is, is this battery is not hooked up, so it would just be to the regular car system. It would be to the regular car's 12 volt system. You got a hot power line coming in here and a ground right here Excuse me And under here we got an air compressor okay and I use this for blowing things out and all kinds of stuff so I'm gonna plug that in and you'll be able to hear how it works with and t"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "pressor okay and I use this for blowing things out and all kinds of stuff so I'm gonna plug that in and you'll be able to hear how it works with and the power inverter on and just the the single hooked up to the battery so instantly you can hear that that's not going to work. So let me hook this up right here and we'll take this and we'll get our other battery involved. Okay, now we're going to try this again. So now we've got the battery, the backup battery hooked up into it right here. and we'll go ahead and listen. And we can run lights on top of that. And I can even run my K-Machine on top of that. You can see the K-Machine with the air compressor, with the lights and key machine, that's how much more power you're gonna get if you have a battery system that's hooked up directly to it along with the rest of everything else. I'm gonna shut this off. Cause that's about enough of that. B"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "a battery system that's hooked up directly to it along with the rest of everything else. I'm gonna shut this off. Cause that's about enough of that. But you can see exactly how much more power you're gonna get this little tiny 1500 watt inverter. I guess it's not too tiny, but you know, people are running, you know, 6000 5000 6000 power watt power inverters and they're still not getting the same amount of power that I am out of this 1500 watt one because they just simply don't have the battery to take the shock load from that so you know the vehicle is running it as soon as we disconnect that battery this power inverter with the vehicle running will not run that air compressor when it is connected when we have that battery back up in there we can run the air compressor, we can run the lights, and we can run the key machine all at the same time with no problems. So take that advice and be"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "we can run the air compressor, we can run the lights, and we can run the key machine all at the same time with no problems. So take that advice and best of luck. Make sure you always consult a professional before doing any kind of electrical wiring or anything like that. Safety reasons, make sure you have the correct batteries. Always check with a professional and get your plan approved by a qualified professional before attempting any of this. Thanks and have a good day. Hey guys, it's the end of the video. You know, help me out and help me help you out. Right below the description box right here is a red subscribe button. Subscribe to me and then you're going to get the latest and greatest information that I put out. Sometimes it applies to you, sometimes it doesn't. You know, it's just going to at least let you know that we're putting out new and current information and then right ove"
  },
  {
    "video_id": "PB0OvFtGmSg",
    "title": "How To Install A Power Inverter In Your Work Vehicle Truck Van Or Car",
    "text": "to you, sometimes it doesn't. You know, it's just going to at least let you know that we're putting out new and current information and then right over here is a thumbs up button. Give me a thumbs up. Help this video rank higher in the searches for the search terms that you're using and let other people be able to see this. You know, that's the best way you can help. Interact. Leave a comment, I will get back with you if I can and try and help you answer your"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "Hey there this is Wayne with Chi County Locksmith Service and today this is the ultimate guide to drill bits. I've been looking for drill bits online, I've been looking for good bits and And it's taken almost a year to get to the point where I'm at now to where I found what drill bits work for what application and why. Because there's so much information online that it's really hard to sift through all of it. Like I said, it's taken me about a year to do so, to find out what drill bit is actually going to do what for what application and how well it's going to work. everybody's got some kind of different drill bit. DeWalt's got them, Milwaukee's got them. There's a whole big long list at the big box store of drill bits and some of them are junk, some of them are okay. But really, if you want a good quality bit, you're going to be ordering something from an industrial warehouse that speci"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "junk, some of them are okay. But really, if you want a good quality bit, you're going to be ordering something from an industrial warehouse that specializes in drill bits and they'll be the ones that offer you the most information. That's how I got to where I'm at now. A couple of notes for this video. I went online and saw a lot of blogs and a lot of different people and a lot of machinists. I figure machinists work with metal all the time. They should know what the best steel is and what the best drill bits are. And every single one of them says that HSS, high speed steel, is the best drill bit there is. You don't need all this titanium coating. It just wears off. You don't need all the cobalt and everything else. It turns out that I found this webpage here, this Cutting Tools Inc. and M1 is considered an HSS, M2 is considered an HSS, M7, M50, and M35. Then you have your cobalt steels "
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "d this webpage here, this Cutting Tools Inc. and M1 is considered an HSS, M2 is considered an HSS, M7, M50, and M35. Then you have your cobalt steels up here and even your cobalt, your super cobalts are still considered an HSS. They're just They're just different forms and different chemical combinations on what does what. So some are a little bit harder, they're meant for drill presses, and some are a little bit more flexible but they not quite as hard so they not going to cut as well for as long But the basic term HSS is such a broad term nobody has broke it down scientifically to actually figure out what all that means And that's what I've done here. In order to cut metal or understand any of the different metal cutting aspects, you have to understand the Rockwell hardness scale. One of the biggest things that I want to say about this video is the HRC numbers on here are just estimate"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": " to understand the Rockwell hardness scale. One of the biggest things that I want to say about this video is the HRC numbers on here are just estimates. They're just numbers that I got offline. They were the most reliable numbers that I kept seeing pop up over and over again under the different types of materials. So please don't leave any comments about, well, it's one point this way or one point that way. That's not the point. Just the different type of steel you have can vary quite tremendously. So what are you going to be cutting? You've got mild steel, regular steel. There's a ton of videos out there that are going to drill grade 8 bolt. And, you know, grade 8 bolts are hardened bolts. They're supposed to be really, really great. At an HRC rating of 33 to 39, that's not really that impressive at all. High grade tool steel, wrenches, hammers, stuff like that, you're going to be up in"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": " HRC rating of 33 to 39, that's not really that impressive at all. High grade tool steel, wrenches, hammers, stuff like that, you're going to be up in the 54 to 58 range. That's going to be where this video is really concentrating on. When we get up a common leaf spring steel or spring steel, you're going to be up there in the 58 to 62 range. chisels are super hard steel that's one of the best steels you can buy as far as tools tool steel you're going to be in the 58 to 62 range stainless steel is super hard as well that gets into the 58 to 62 range hard plate a hard plate is an anti drill plate its sole purpose is to stop drill bits that's one of the things that we're going to be covering today that can be anywhere the industry minimum and the industry meaning the security industry has a minimum HRC rating of 60 for all security applications so it has to be at least 60 so that's one of "
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": " the industry meaning the security industry has a minimum HRC rating of 60 for all security applications so it has to be at least 60 so that's one of the numbers that we can at least have some sort of definition that's going to be the bare minimum and then it'll go up to there I found some research and some of it goes all the way up to 72 they add carbide flakes and chips and other things into it to increase that hardness. You know here some of the Rockwell hardness scales for HSS Your tool steels like we went over there for drill bits a drill bit hardness is going to be 63 to 65 And then cobalt. Cobalt drill bits are the new big thing. They're actually getting really, really popular. A lot of discussion online is, do I go HSS or do I go cobalt? Well, if you go by this right here, it says that their cobalt bits are still considered a super HSS bit. So it's really, really confusing. M3 HS"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "balt? Well, if you go by this right here, it says that their cobalt bits are still considered a super HSS bit. So it's really, really confusing. M3 HSS 5% cobalt was what I got off of this website right here. They're saying that's going to be a 65 to 67, and the M42 super cobalt is going to be right around that same range. So that's a whole lot of information to take in. Basically, I break it down scientifically and then it's a simple fact of scientific numbers. If you've got a drill bit that's a good percentage harder than what you're trying to drill, you can drill it. If it's not, it's going to fail. The other thing is it's sharp because you can get carbide bits like this one here, but it's not sharp. It's a masonry bit. I've got diamond-plated drill bits that we're going to use today. today. Solid carbide bits that we're going to use today. This is a more rigid carbide tip bit that we"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "plated drill bits that we're going to use today. today. Solid carbide bits that we're going to use today. This is a more rigid carbide tip bit that we're going to use today. I got the DeWalt cobalt bits right here. These are cobalt bits. That's going to come in that. And then these are supposed to be the best HSS bits you can buy. This is a $300 set of drill bits right here. This is as good as get us it's going to get for hss so we're going to put them all to the test i'm going to put them all in the drill press we're going to start drilling stuff we're going to drill hard stuff soft stuff we're going to see where everything lines up on the on the field all right right here we've got our high quality uh hss bits it's a 300 set of bits that's um they're very high quality i've been using them for a while these are really good bits but this is going to show us what the the limitations of a "
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "s um they're very high quality i've been using them for a while these are really good bits but this is going to show us what the the limitations of a good quality high speed steel is going to have. So right here we've got just a regular old piece of mild steel. We put a little cutting paste like this grade 8 bolt right I'm gonna take this grade eight bolt and get a little bit of paste. I'm going to go ahead and drill through that quite nicely as well. But once again, when we look at the hard scale, grade 8 bolt, you know, at 33 to 39, that's not that great. Normal steel, you're going to be looking at anywhere from 20 to 36. So this really isn't that impressive in any of the other videos that you see out there. This isn't that impressive of a beat. You can tell it's definitely going to cut all the way through this thing. But for shortness of video, let's move on to the next subject matter"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "a beat. You can tell it's definitely going to cut all the way through this thing. But for shortness of video, let's move on to the next subject matter where we start getting into something a lot more solid and heavy-duty here. This is a punch. Okay. This is an American-made punch. So it's very, very high-quality steel. So let's see here. I'm going to start to see the limitations of this drill bit. Get it in a little bit, and now that's it. It's only come in a little bit, and now I'm pushing, I'm really pushing on this. See it flexing and that is all more than it's going to tap. It just cut a little bit and then that's it. So it's not a little press, it's simply the steel involved here. I'm going to put a little paste on there and see if that's going to tap that again. No, it's just not going to do it. We found the limitation here. We have some tool steel, approximately an HRC rating of 5"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "t's going to tap that again. No, it's just not going to do it. We found the limitation here. We have some tool steel, approximately an HRC rating of 54 to 58. We've got a couple other things. We have some spring steel. There's a leaf spring. It needs to go here. We're still getting some cutting on here. even though this is a harvest field. We're going to see where it's going to die. That's it, right there. So it did go into a quite a ways, but it did finally find a spot where it was done. And it's just going to stop. That's the chance to something like this. Here again, this is hard plate, hard steel plate. This is specifically designed not to have anything penetrated as far as the standards of it. This one hasn't even given it a chance. We didn't even get any filings off of this one. That's how hard this stuff is. It didn't even make, like if I scratch that, that didn't even make an ind"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": " didn't even get any filings off of this one. That's how hard this stuff is. It didn't even make, like if I scratch that, that didn't even make an indent hardly on there. So this stuff is super, super hard. A couple other things, a chisel, definitely super hard. Got a drill bit, spade bit, not quite as hard. It's going to cut on it just a little bit, but again it's going to stop too. This is a little harder. Add a little bit of cutting paste on there. You're just not going to get... It's not going to be that effective. That is a standard HSS bit or actually a really high quality HSS bit That going to show you the limitations and the different kinds of steel tool steel where it going to stop and fail All right these are the cobalt bits right here. You know Irwin has cobalt bits, DeWalt has cobalt bits, the high-end industries have cobalt bits. you know there's going to be a little bit of "
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": " here. You know Irwin has cobalt bits, DeWalt has cobalt bits, the high-end industries have cobalt bits. you know there's going to be a little bit of fluctuation but the basic idea is that adding cobalt to high-speed steel and making a cobalt or super HSS that's what my understanding is they're not a coated bit because we all know that the titanium coated or zinc coated those coatings were off and then it's just a junk drill bit and that happens fairly quickly these drill bits are all solid, you know, they're solid, made out of material. That's what makes them at the top end of their game. So we're going to try this one out and see where the limitations are on it. All right. Let's start again right here. This is mild steel. Very nice. It's very nice and smooth, no squeaking. Very easy, very nice and easy to cut right through that. Okay, let's move on to something a little bit harder. We'"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "very nice and smooth, no squeaking. Very easy, very nice and easy to cut right through that. Okay, let's move on to something a little bit harder. We'll go back to this four-wheel. This punch. Now this punch is a great example of different harnesses of steel because this punch is a the steel because this punch has to be harder than the steel that you're punching in order for it to make an indent on it so that's how we know this is a good hard steel it's a good test okay we're starting to get some filings we're picking up in the same spot where we left off with the hss so it is trying to drill it Okay so we got this here and it starts a little hole over here You can see again we just going to get through the skin and then that going to be it That going to be where this bit going to stop We're going to cut through the same wrench and jiggle all we want. When this bit is done cutting on thi"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": " That going to be where this bit going to stop We're going to cut through the same wrench and jiggle all we want. When this bit is done cutting on this particular type of material, we can wring out the spring steel. Just trying to get some heading on there. A little bit of squeegee so we can get some taste on there. So that's a difference right there between the Cobalt and the HSS. The HSS stopped right here. The Cobalt did go ahead and do the sphinct steel. A couple other metals that we can try. 3D bolt. This is really key using some kind of lubricant, cutting paste, grease, oil, some sort of cutting fluid to make sure your pit stays cool. The cutting process is definitely a very good practice to have. Thanks we going to go right to ready ball two Go right through grade 8 bolt 2 Once again this anti plate holds true There is a little bit bigger indentation now than there was with the HS"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "ball two Go right through grade 8 bolt 2 Once again this anti plate holds true There is a little bit bigger indentation now than there was with the HSS, just plain HSS bit. I can feel that one with my finger there, the fingernail. So they're definitely a tiny little bit harder. However, they're not that much harder. They're not hard enough for chisel steel or anything else. But they are definitely a little bit harder. Here's this bit right here too. And see, that's where the other HSS bit stopped drilling. This one actually did continue to get some filings from it. So you can definitely tell that it is slightly harder. However, just down a little bit more, and it's getting harder inside this particular metal, and it's death-heaven. All right, what we've got here is a diamond-coated drill bit. It basically has little particles of diamond on it and it's on a regular twist style drill bit. "
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "t, what we've got here is a diamond-coated drill bit. It basically has little particles of diamond on it and it's on a regular twist style drill bit. You know, I figured hey, it's diamonds, it's the hardest thing on the planet, it's got to work really good. But no, this is kind of the joke of the day. This drill bit doesn't do anything very well. regular steel a little filter regular steel I think part of this V-205 Sallqvist Sugarenden V-205 Sallqvist Sugar Charging stand HERR Puis function ...steel. Now we're up to the steel. Once the tiny little granules of diamond get more off of there, you're just not going to see any performance out of it. It doesn't take long to wear the diamond edgings off the top of the tip, and after that is gone, this bit is not going to work very well for anything. So you can see we're really pushing on it. And no flash flash Again, the bar plate And the movi"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": " this bit is not going to work very well for anything. So you can see we're really pushing on it. And no flash flash Again, the bar plate And the moving action And that's about it That's all there is to the Capitola And that is Diamond Pit ok, now we've gone through HSS and the cobalt infused HSS bits, or the cobalt bits, whatever you want to call them, and now we're moving on to something that's definitely harder, ok? This here is a carbide tipped masonry bit, ok? The tip, as you can tell, is just a wedge of carbide. Det er veldig blundert. Hvis du kan starta denne biten, denne biten driller større stål, men den har en tendens til å vobla innen den f en st Jeg vil demonstrere hvor demonstrate where the other drill bit stopped A carbide bit like this can go ahead and definitely keep drilling in some applications but it's not going to be ideal. It's like drilling with a blunt object. It's"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": " like this can go ahead and definitely keep drilling in some applications but it's not going to be ideal. It's like drilling with a blunt object. It's like trying to shovel with a blunt shovel. It just doesn't work that well. So here's some mild steel. You can see how the bit just walks around and walks around on it until it gets a bite in and then it will finally begin to drill. But it's a very slow process. It's chipping the steel so it's getting very hot but it will do it. So this drill bit isn't that great for these drilling applications. It has the ability to do it, but it's not ideal because of the bluntness of it. That's the loud steel. It's just going to wobble around. It's not going to be very easy. Watch it dance right off it. So that's not a very good application. is we flip it over and start in the drill bit hole where we started the other one, and it'll go. See, we're gettin"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "that's not a very good application. is we flip it over and start in the drill bit hole where we started the other one, and it'll go. See, we're getting five of them, so that means it is harder on the scientific scale. That little piece of carbide is definitely harder than everything else. I guess doing the job is just too much of an invasive Ok so finally the first movement that actually going to cut all the way through this is a carbide tipped base stye bit But it actually does very well on these carby stiles. The hard plate is going to walk and dance, walk and dance, walk and dance. Let's try it. You can see how small and teeny tiny the flakes that we're giving off of this hard plate. This stuff is going to take forever to drill through this fill bed. But it is actually moving a small amount of material at a time. The only one that's managed to do so is what's over. Takk for ating med "
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "his fill bed. But it is actually moving a small amount of material at a time. The only one that's managed to do so is what's over. Takk for ating med Now this is the only bit that managed to even touch this hard plate steel that's guaranteed to be at least a 60 on the HRC. So, but you've got a helmet tip to do so. So that's what a carbide tip bit can do for you in these situations. However, it is a bit like running a blunt object into the ground. Okay, now we have this carbide tipped locksmith style bit right here. And what this has is it has this tip in here, but it's a very high grade steel going into it and it's a lot more rigid than like say a masonry bit. That's going to be the difference between the two. Locksmith bit like this has the hardness and can take the heat down here, but it also does well on pretty much every application. So this should reduce the jumping or the wandering"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "e hardness and can take the heat down here, but it also does well on pretty much every application. So this should reduce the jumping or the wandering back and forth between the other two pads. So we'll get that going in. Let's take that out a little bit. Heading through the material. Swing scale. The big spirals that we've got. Right here. This thing right here. This is pretty long. Right there. It's rakes down. Touch. High quality tool steel modern The difference between this and the masonry style bed is the rigidity. It's just a lot more stable bit to be able to find a spot and get that first little gouge into it. Whereas the Vestiaire did a lot of long and very, very fun bits. It has a lot of sharp ridges. Carbide takes heat very, very well. So it won't get hot. but it's able to withstand that heat very very nicely. Solid carbide bit the difference between this and all the other ones"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "well. So it won't get hot. but it's able to withstand that heat very very nicely. Solid carbide bit the difference between this and all the other ones is the entire bit is made out of carbide And then if you can see Right here You can see that the edge is actually ground down to a bevel Okay now what that going to mean is there going to be a sharp edge where as opposed to the other you know like a masonry bit this is actually going to be sharpened. The masonry bit is going to be very blunt, and it's going to tend to walk really badly on steel and not want to go down and have its own center punch. These should center by themselves and drill. It's just a matter of if the edge is going to hold on it very long or not. So we'll pop that in there. The plate here, this is guaranteed at least 60 on the hard scale. So, clamp this down. We're getting nice flakes coming off of this. You can see com"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": ". The plate here, this is guaranteed at least 60 on the hard scale. So, clamp this down. We're getting nice flakes coming off of this. You can see compared to the other drill bits, they just completely stopped. I mean this stuff, this drill plate, the anti-drill plate is designed specifically just to stop drill bits. So the fact that we're getting these nice big shavings and cuttings up here is quite impressive really. Just want to make sure to really keep this thing lubricated. That's pretty impressive in the air. That's at least a 60 on the hardness scale, rock ball hardness scale. Could be a little more, could be a little less, we don't know exactly. Another drill bit. I going to go ahead and clamp this one down G G G G G G G G So, you know, keep going with other things. This is going to be a fairly mild tool steel hammer. I'm going to try to get the wood out of here. You know, that's"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "now, keep going with other things. This is going to be a fairly mild tool steel hammer. I'm going to try to get the wood out of here. You know, that's got to be pretty hard steel right there. That's about the hardest stuff that I can really find. I mean, we've done spring steel, we've done stainless steel, we've done chisel steel. All that stuff is going to be in those higher brackets And there not much anything else out there that hard enough to even warrant trying to drill through So, these bits are really good. They're from Drillbit Warehouse. And it seems as though that they need a special job. They need to be in a drill press, or they need to have a very, very steady hand and constant pressure, very consistent pressure if you're using a hand. I would recommend the larger size bits. I think when you get down to the smaller size, you know, the littler sizes, I can imagine these breaki"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "a hand. I would recommend the larger size bits. I think when you get down to the smaller size, you know, the littler sizes, I can imagine these breaking quite easily and not being that effective. That's the drill bit test. For more information go to www.tri-county-locksmith-service.com. Okay, so the purpose of this demonstration is to show you just how superior a carbide bit is to a HSS bit. This is an HSS bit that we've got here. made a little flat edge so that can have a chance to get started on there. Our wires should be able to make a trip. You can see the filings just coming right up. This is a solid HSS bit. you know, a fairly quality bit. But that's the difference between high-speed steel and common steel. Check that. Now you can see that if this drill bit is going to drill through high-speed steel, there's no high-speed steel drill bit on the planet that's going to be able to com"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": " that if this drill bit is going to drill through high-speed steel, there's no high-speed steel drill bit on the planet that's going to be able to compete with this. It's a simple physics, like I was trying to explain on this piece of paper right here. It's a Rockwell hardness scale. If you have something that's harder than something else, by a certain amount of percentage points, it's going to drill through it. and where HSS stops is right around the 50, right around the 54, 58 hardness scale. And that's going to be your tool steels and starting to get into your spring steels. There's going to be some variance on there. Somebody may be able to drill through a leaf spring. I've had it happen. You could drill through one leaf spring, and then the next leaf spring in the same pack won't touch it. You need something like carbide like this. But this is just a great drill bit that has carbide"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "n the next leaf spring in the same pack won't touch it. You need something like carbide like this. But this is just a great drill bit that has carbide and it's actually sharp so it actually has a chance to get a cut. It's not just trying to ram a blunt object through something. And that's a perfect example of it right there. Okay, let me show you what we've got going on here. This is the DeWalt Cobalt bit. These are the black ones, Cobalt bit. It did fairly well in the testing, but right now this is just back to the science of it, whereas one thing, one material that's way harder than the others is going to convey it. And this is how we show that carbide bit is actually going to drill through this other drill bit right here. So we starting to get pretty warm Make sure we keep the location in there There you have it There. This is cobalt. This is going to be the hardest thing on this scal"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "to get pretty warm Make sure we keep the location in there There you have it There. This is cobalt. This is going to be the hardest thing on this scale. This thing is going to have an HRC of probably around 63 to 65. I'm sure the really good drill bits that you buy from the supply store have a much higher, like the 65, 67 HRC. our scene but this is the difference between carbide and a regular drill bit or even a cobalt drill bit it just doesn't stand a chance the carbide is so so much harder than it that it just doesn't have the chance to be able to stand up with it if you're going to say that another drill bit that cobalt is going to work that good i mean this drills right through it and and it did in fairly quick fashion, two squirts of lubricant, and it's right through it. So these sharpened carbide bits are really the way to go. There's just no excuse. They just, they work better. As"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "ubricant, and it's right through it. So these sharpened carbide bits are really the way to go. There's just no excuse. They just, they work better. As long as you keep it in a controlled environment, keep the pressure even, keep them lubricated, and don't get any side force on them, they really perform really well, and they're really going to cut through some of the stuff that nothing else is going to even come close to. So to kind of conclude our drill bit evaluation here, we started out with a very high quality HSS bit right here. And, you know, this is a good quality bit that does most things well. As soon as we start moving up in the scale of things here to the harder stuff. As soon as we start getting that 50, 54, 58 range, it's just going to stop working there. The cobalt bit that we saw here is going to work pretty well on a lot of things. It's going to get you a little bit higher"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "oing to stop working there. The cobalt bit that we saw here is going to work pretty well on a lot of things. It's going to get you a little bit higher. It seemed to do a little more damage to the the spring steel and the stainless steel knife However it still has its limitations As soon as it starts to get down into that hardness of the steel it loses all of its force and all of its penetration. And then, you know, the ultimate is the carbide, solid carbide with a sharp edge is the key thing. I mean, that's your cobalt bit right there. There's no argument which one's harder and which one's sharper. You know, and then we had the Bosch bit that has carbide, okay, so it's going to have a little more rigidity to it, but it's going to tend to walk and wander a lot on you. If you can get it started or you can get a little bit of a hole ground with something else first, these little bits are gr"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "lk and wander a lot on you. If you can get it started or you can get a little bit of a hole ground with something else first, these little bits are great and they're going to be a lot more forgiving in a hand drill because that blunt edge is going to be a lot more forgiving but it's going to take a lot of force and a lot of effort to get this to drill through that harder steel but it is going to be more flexible and forgiving that way but for you know for the controlled environment if you're in a drill press or a very steady hand drill the sharpened carbide bits do work really well the edges just chip out on them and that will happen it's just part of the game the sharper and the finer you get the more it's going to cause that to happen so i wouldn't recommend using anything smaller than than this like 3 8 right here with these at least that gives it enough meat to try and stand up we us"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "i wouldn't recommend using anything smaller than than this like 3 8 right here with these at least that gives it enough meat to try and stand up we used a quarter inch here to drill through this cobalt but um you know it is what it is and made it through there how long that's going to last and how many times you can do that is yet to be seen so this is Wayne with Tri-County Locksmith Service you can get your cobalt bits at Home Depot or Lowe's you can get your really good grade HSS bits through any welding supply store you can get your Bosch bits through any good box store Lowe's Home Depot and you You can get your solid carbide bits from Drogowarehouse That where I got these at You can put a promo code in Put Lockman1 into your order as a promo code and you get a discount off your order This is Wayne with Tri-Candy Locksmith Service and that's the full drill bit evaluation. There's noth"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "promo code and you get a discount off your order This is Wayne with Tri-Candy Locksmith Service and that's the full drill bit evaluation. There's nothing else to really cover. We've gone from one end of the spectrum to the other. The only thing we've really left out was the cheapo bits, like the black and decker bits that don't even belong in this category anyway. So, thank you for watching. Click the subscribe button. I always like to do reviews, tool reviews, drill bit reviews. I do reviews on just about everything, especially when it takes me this long to find a product that I'm looking for. So, keep subscribing and we'll see you next time. So, this is Wayne with Tri-County Locksmith Service. For more information, go to www.TriCountyLocksmithService.com. Thanks. Alrighty guys, this is the end of the video when you watch YouTube here. A couple ways you can really help me out is to go a"
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "smithService.com. Thanks. Alrighty guys, this is the end of the video when you watch YouTube here. A couple ways you can really help me out is to go ahead and make sure that you subscribe. Click on the subscribe button right there and then come down here and share this video with Facebook and Twitter and any of the other social media facets that you are a part of. This helps other people find my videos. It helps my videos gain count and gain accountability and views and that in turn helps me provide more videos to you with good information about security and the latest in technology today. So Facebook, Twitter, Google Plus are about the biggest ones. Those are the ones that help out the most and just posting those on there lets your, it spreads that information to your friends, family, anybody else that would be interested in watching one of these videos and it helps me get the countage "
  },
  {
    "video_id": "pmEeR5MTjrg",
    "title": "Best Drill Bits For Metal, Stainless Steel and Hardened Steel",
    "text": "eads that information to your friends, family, anybody else that would be interested in watching one of these videos and it helps me get the countage I need to be able to continue to make videos and provide the information to you. So this This helps out a lot. Thanks a lot. Have a great day."
  },
  {
    "video_id": "70r6r0SMhjg",
    "title": "Lost Code Fix Factory Default Reset Code Schlage BE 375 Deadbolt Lock Lost Combination FAQ",
    "text": "Okay, so let's say that you lost your paperwork and you no longer have your programming code or you changed your programming code and you don't know what it is anymore and nobody knows what it is. This happens when new houses get bought, tenants get changed, businesses move around, and the previous owner doesn't give all the information out, what you'll need to do is you'll need to factory default your lock. Basically, you're going to set it right back to factory code standards, and there's going to be a sticker on the inside of your lock right back here. If you take this apart, there's going to be a sticker on the inside that tells you what the original factory codes were, the programming code and user A and user B. So basically, if you come up to this lock and we no idea what it what's programmed in it and and what the codes are what you want to do is you want to take the back cover of"
  },
  {
    "video_id": "70r6r0SMhjg",
    "title": "Lost Code Fix Factory Default Reset Code Schlage BE 375 Deadbolt Lock Lost Combination FAQ",
    "text": "me up to this lock and we no idea what it what's programmed in it and and what the codes are what you want to do is you want to take the back cover off that covers right here okay just slides right off on and off have it right here you're gonna disconnect the battery okay disconnect the battery we're going to push the schlag button basically we're energizing the lockdown even you heard it beep even though the batteries in my hand okay so the next set of events that needs to happen needs to happen within 10 seconds or less. We need to hook up the battery to the lock and push the Schleich button until the indicator light is green and the lock beeps. So we're going to hook this up real quick and then in under 10 seconds push and hold the Schleich button. So we going to hook this up and then we going to green light So now this has been green light So now this has been restored to the factory"
  },
  {
    "video_id": "70r6r0SMhjg",
    "title": "Lost Code Fix Factory Default Reset Code Schlage BE 375 Deadbolt Lock Lost Combination FAQ",
    "text": "ich button. So we going to hook this up and then we going to green light So now this has been green light So now this has been restored to the factory default settings which we do still have the paperwork. I'm just giving this as an example. So our factory code of 6841 now does work. Okay, everything's working good. You're good to go. you can use that programming code write those down those numbers on the inside of this lockdown and you can program the lock however you want following the instructions if you don't have this booklet check out my other videos I go through how to program this add and delete user codes but this is going to get you restarted again in a pinch so for more information check out the website below hey guys it's the end of the video you know help me out and help me help you out right below the description box right here is a red subscribe button subscribe to me and "
  },
  {
    "video_id": "70r6r0SMhjg",
    "title": "Lost Code Fix Factory Default Reset Code Schlage BE 375 Deadbolt Lock Lost Combination FAQ",
    "text": "d of the video you know help me out and help me help you out right below the description box right here is a red subscribe button subscribe to me and then you're gonna get the latest and greatest information that I put out sometimes it applies to you sometimes it doesn't you know it's just gonna at least let you know that we're putting out new and current information and then right over here is a thumbs up button give me a thumbs up help this video rank higher in the searches for the search terms that you're using and let other people be able to see this you know That's the best way you can help interact leave a comment I will get back with you if I can and try and help you answer your questions but the more you interact and post this to Facebook Twitter Google Plus and Spread this through the social media the more that allows me to be able to help do more videos so thank you so much for"
  },
  {
    "video_id": "70r6r0SMhjg",
    "title": "Lost Code Fix Factory Default Reset Code Schlage BE 375 Deadbolt Lock Lost Combination FAQ",
    "text": "cebook Twitter Google Plus and Spread this through the social media the more that allows me to be able to help do more videos so thank you so much for watching I really appreciate it and Subscribe share and like thanks a lot guys appreciate it"
  },
  {
    "video_id": "3kkVIpYahR0",
    "title": "Litelok world's first anti-grinder angle grinder resistant bike lock, top rated best bike lock 2022",
    "text": "All right this is Wayne here with Tri-County Locksmith Service and this is the Kryptonite New York forget about it U-Lock for bikes. So what we're gonna do is we're gonna do an angle grinder test on this. The angle grinder is easily the most powerful tool on the market today for theft. You can get a high-capacity 18-volt battery on Milwaukee, DeWalt, Makita, almost any of the manufacturers make this. It's lighter than bolt cutters and it fits in a backpack or a bag very easily. So this is the number one tool for theft these days. Let's test it against this lock that we literally just took out of the packaging a minute ago. And we're gonna put it on this way and we're gonna see how long it takes to go ahead and cut through this. Now they use a really high security key so this can be picked. It has been done. It's really difficult to do and it takes a couple, it takes some special tools to"
  },
  {
    "video_id": "3kkVIpYahR0",
    "title": "Litelok world's first anti-grinder angle grinder resistant bike lock, top rated best bike lock 2022",
    "text": " a really high security key so this can be picked. It has been done. It's really difficult to do and it takes a couple, it takes some special tools to be able to do so. I'm not worried about this. Today's criminals are brute force tactics, which is this tool here. So now I've got it set up on here. I'm gonna make a cut. I'm gonna try and twist it off. I'm gonna do whatever it takes to get this lock off of this scenario here. You would have, you would just have your bike tire under this side here. So we're gonna start in one, two, three. Make sure you have hearing protection, eye protection, and gloves. So, we'll have to look at the times, but I would say that's probably a minute, maybe less, maybe a little bit more, but within a minute or two, your bike is gone. All right, so this is Wayne with Tri-County Locksmith Service, and today we are looking at the Light Lock. Now, this was a prod"
  },
  {
    "video_id": "3kkVIpYahR0",
    "title": "Litelok world's first anti-grinder angle grinder resistant bike lock, top rated best bike lock 2022",
    "text": "wo, your bike is gone. All right, so this is Wayne with Tri-County Locksmith Service, and today we are looking at the Light Lock. Now, this was a product that I actually did some testing and reviewing on a couple of years ago. And I saw when they did some of their testing and cutting resistance video, they did a really good job of making it bolt cutter resistant. And I believe that, and it was 100% true, it's completely bolt cutter resistant. But it's not angle grinder resistant. And we did that testing, and very quickly, this is the number one burglary tool across the world right now. This is how people are stealing bikes, cutting chains, cutting bike locks, and cutting just about anything that's security related. This is the most powerful, easy to pack, cost effective tool for theft in the entire world right now. 18 volt cordless grinder This is even the bigger version with the six inc"
  },
  {
    "video_id": "3kkVIpYahR0",
    "title": "Litelok world's first anti-grinder angle grinder resistant bike lock, top rated best bike lock 2022",
    "text": ", easy to pack, cost effective tool for theft in the entire world right now. 18 volt cordless grinder This is even the bigger version with the six inch blade and the more powerful motor We have a brand new 9 9 battery on here and this thing is ready to go It cuts through every single other lock that I ever seen Matter of fact it just cut through this kryptonite lock in under a minute. I'll have to look at the footage and see exactly how long it took, but it was not very long at all. LightLock has new technology for this lock that's actually installed in here designed to resist that angle grinder. I am extremely skeptical because I've cut every single type of chain, padlock, U-lock, and everything possibly imagined on the planet. I've cut through it with that angle grinder. They're telling me that this can't be cut with that angle grinder, or at least not in an effective manner, where you"
  },
  {
    "video_id": "3kkVIpYahR0",
    "title": "Litelok world's first anti-grinder angle grinder resistant bike lock, top rated best bike lock 2022",
    "text": "rough it with that angle grinder. They're telling me that this can't be cut with that angle grinder, or at least not in an effective manner, where you wouldn't use two, three, four, five, six blades, two, three, four, five, six batteries, and other things involved with it. So this is their armored 1X version. They're going to have a few different versions of this. This is their 1X version, and this is the new technology is baronium or baronium. It's going to be laced throughout the lock and the shackle and this part here so that we can't have any weak points. Also, it's ground flat so that you can't really twist it. You will have to make two cuts. So even if we do get through this on one cut, we're going to have to make an additional cut to be able to sever the lock itself to be able to pull whatever's off of here off. Now, obviously, I'm just working in my shop, but you would see that t"
  },
  {
    "video_id": "3kkVIpYahR0",
    "title": "Litelok world's first anti-grinder angle grinder resistant bike lock, top rated best bike lock 2022",
    "text": " be able to sever the lock itself to be able to pull whatever's off of here off. Now, obviously, I'm just working in my shop, but you would see that there would be a bike or something attached to this through this wheel right here. The key, very, very pick resistant. Trust me, I know there's picking videos out there, but the average person is not picking this lock. It takes a ludicrously skilled lock picker with a specific tool to be able to... I have played with this lock. I have played with the picks. And even if you have one, it is ludicrously difficult to do and requires a tremendous amount of practice to be able to do it sufficiently. So the lock is not the weak point on this. It's all brute force attack. So let's get this thing started. Make sure you have safety equipment. and these are safety rated glasses, hearing protection, and gloves. Thank you. Thank you for watching Hubsan x"
  },
  {
    "video_id": "3kkVIpYahR0",
    "title": "Litelok world's first anti-grinder angle grinder resistant bike lock, top rated best bike lock 2022",
    "text": "d. Make sure you have safety equipment. and these are safety rated glasses, hearing protection, and gloves. Thank you. Thank you for watching Hubsan x4 H502E Desire 4 Ok, så det har brukt min blade. Det er derfor vi har det på forvaltningskontakt på for dine händer. Det har brukt min blade. Ok, det er galet. Og du kan se at det er nærmere all the way cut through. I work with metal and use this tool a lot, so I'm very familiar with how it works and how it operates. I can tell you that I can feel the lock grabbing my blade as I'm trying to cut through it. I can feel it. There's actually a lot of technicality in the amount of pressure that I apply, because if I stop in there, it's going to bend and flex the blade, and it's going to do even worse damage to me. Så jeg kommer til å prøve å gå inn med denne blade. Om det ikke fungerer, så tar vi en annen. Så nå, enn blade startar å disintegrere"
  },
  {
    "video_id": "3kkVIpYahR0",
    "title": "Litelok world's first anti-grinder angle grinder resistant bike lock, top rated best bike lock 2022",
    "text": "se damage to me. Så jeg kommer til å prøve å gå inn med denne blade. Om det ikke fungerer, så tar vi en annen. Så nå, enn blade startar å disintegrere, du kan se, nå er det tost. Så den har allerede fendt av en grinder blade. Nå, de fleste mennesker og kriminelle kommer ikke til å brylle med flere blades med dem. Det er bare ikke sånn kriminelle ruller. They want to smash and grab. Done. These are not cheap blades either. This is a Diablo metal cutting blade. This is one of the best cutting blades on the market right now. I don't buy cheap blades because they fly apart. I've never actually seen one of these fly apart before. So the fact that it did it on this is extremely impressive. I did it again. Completely destroyed my blade again. I'm not going to run it back in there because I know it's just going to continue to disintegrate this blade and I don want a chance having any more things"
  },
  {
    "video_id": "3kkVIpYahR0",
    "title": "Litelok world's first anti-grinder angle grinder resistant bike lock, top rated best bike lock 2022",
    "text": "not going to run it back in there because I know it's just going to continue to disintegrate this blade and I don want a chance having any more things flying around stabbing me I going to run one more blade through it and if that doesn get it I going to call this thing angle grinder resistant proof whatever you want call it, but I am extremely impressed. Again, brand new blade. All right. So we've got at least two discs and, I don't know, five or ten minutes of cutting to make one cut. And you can't get this off of here yet. Okay? You can try and pull. I can't turn it. So now I have to make another cut. Okay, so were we able to cut through this with an angle grinder? Yes. Were we able to do it easily? No. After we destroyed two blades, high quality blades, versus maybe 30 seconds to a minute, that we got out of this one. So as far as security goes, all you're buying was true security. If"
  },
  {
    "video_id": "3kkVIpYahR0",
    "title": "Litelok world's first anti-grinder angle grinder resistant bike lock, top rated best bike lock 2022",
    "text": " quality blades, versus maybe 30 seconds to a minute, that we got out of this one. So as far as security goes, all you're buying was true security. If people really want to get the real deal, real message out, all you're buying with security is time. And this bought you 10 times the security that this bought you. For more information, check out the website below. Look forward to doing more testing on the product. I believe they actually have one that's even higher grade than this. So we're going to test that out too."
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "Hi, what's going on? This is Wayne with Tri-County Locksmith Service and today I'm going to be showing you how you can use our Stanley ASSA High Security Core Padlock in combination with our PayWag security chain that cannot be cut. We've already proven that. I'll even post some of the videos that show you the anti-drill features of this lock and the bolt cutter resistance of this chain and the bolt cutter resistance of this lock. I'll post that after the video because this is kind of a different market for this particular setup, but I'm going to show you how this chain can save your trailer. So basically what you're going to do is we've got a 15-inch rim right here, okay? and let's see where does it say that right here yeah this is a 15 inch rim and it has the triangle holes in it okay now that's going to be the key thing is that it has to have these triangle holes in it so we can stick"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "ch rim and it has the triangle holes in it okay now that's going to be the key thing is that it has to have these triangle holes in it so we can stick the chain through Come through there. Bring our shackle up here. Right on around and back. Just like so. So this is proving that this will work with a 15 inch tire. Even if you have an extra set of tires, you only need to block one off. You can tie the two tires together. You can chain them together, but that may, you know, that would require more chain. This is going to be a way to where it's going to fit all the way through It going to be you know right here where it nice and easy to access and then it going to be right through here Okay And I actually wrapped that wrong you don have to wrap it like that if i had wrapped it the other way it just come right through now this system right here if somebody tries to steal your trailer guess w"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "p it like that if i had wrapped it the other way it just come right through now this system right here if somebody tries to steal your trailer guess what's going to happen it's going to lock this tire up so they're not going to be able to go anywhere um like i said check out the end of the video if you haven't seen this lock uh verse um and chain versus bolt cutters but it's completely amazing this stuff will actually break the jaws of the bolt cutters because the paywag chain is so hard it's rockwell hardness 63 and the tool steel in your bolt cutters is only going to be in the 40s or 50s at the most so it's going to chip your your thief's bolt cutters the way that this works here is these two links of chain don't allow any room to have access for bolt cutters and the shackle shrouding protects that as well. So when they try and take off with this trailer, guess what? It's not going to "
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "cess for bolt cutters and the shackle shrouding protects that as well. So when they try and take off with this trailer, guess what? It's not going to happen. Now the only thing you need to be concerned about is if you have these little holes here. If you have these holes here, these round ones, the chain is not going to fit through. But guess what? You can go to your local hardware store and you can, or like a ranch ride or your tire supply store, even Walmart has them with the triangle holes. Get the triangle hole ones. They're 50 bucks a piece. They're probably 84 for the, or 85 for the 15 inch. They're about 54 for the 13 inch. And that's how you can lock this system up. Now I'm going to go ahead and unlock this and I'm going to show you that it's going to work on a 13 inch rim too. Let's come on around to this side. We can shut this welder off. I've just been changing this to where I"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " that it's going to work on a 13 inch rim too. Let's come on around to this side. We can shut this welder off. I've just been changing this to where I can run a 15 inch tire on it. And we'll go ahead and take this. Just like so. One link will fit through, as you can see. Thank you Once again here we are it's locked to the spring hanger. It's not going anywhere. This system is not going anywhere. Even if they take the tire off, the tire is still chained to the axle. So what are they going to do with it? They have to drag it along with them. so it's not going to do them any good to do either or they're not going to be able to take the tire off if you're really concerned about that you can buy the locking security uh thread nuts um that that go on as your lug nuts um but for the most part this is going to be it you're going to try and take off and they're not going to be able to and if they"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "o on as your lug nuts um but for the most part this is going to be it you're going to try and take off and they're not going to be able to and if they try and use a torch to cut this which is other than an angle grinder the only way to do it even if they use an angle grinder you're going chance getting into this tire and flattening it from the get-go. So they're really just going to destroy their own property. You know, there's just no better way to secure this system than this right here. It's going to go through the rim, it's going to go to the trailer, it's going to go to the spring hanger, and then this is going to be rock solid. These are just going to, they're going to try and cut this, and then they're going to move on to a much, much easier target. Now there There is one more thing we can do with this lock if you want to order an extra lock and use it for the tongue. I highly rec"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "h easier target. Now there There is one more thing we can do with this lock if you want to order an extra lock and use it for the tongue. I highly recommend we do that as well. So hold on one sec. I'm going to undo this and then we'll go put that on the tongue. Alright so we going to take this lock and we going to put it probably in the sun sorry about that so then you going to lock this you may need to drill this out to a three-eighths inch hole or a little bit bigger i had to drill mine out but you put that on there boom once again not really going to be able to get a grip with bolt cutters right here or here. They're going to be faced to deal with the shackle shrouding. And again, you're going to be amazed at the drill resistance of this lock. It cannot be drilled out. It's got hardened steel inserts in there that if you try and drill absolutely perfect, it's going to mess you up. The"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " lock. It cannot be drilled out. It's got hardened steel inserts in there that if you try and drill absolutely perfect, it's going to mess you up. The big spinner, if you try and drill the entire plug out, that's going to stop you and if you get through all that there's still more hardened pin inserts inside so you're just not going to be able to get through it so for more information check out the website below you could run one of these on each side if you wanted to with the chain and this one here and that's I mean people are just going to see that and they're just going to they're just going to walk away or go find something a whole lot easier that's the main thing with security You don't have to outrun the bear. You just have to outrun everybody else make your trailer look so Secure that they just go steal somebody else's you can't stop crime, but you can stop them from stealing you"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " everybody else make your trailer look so Secure that they just go steal somebody else's you can't stop crime, but you can stop them from stealing your stuff Or at least make it very very very obnoxious and very very difficult to where they never want to tangle with that again for more information Check out the website below stay tuned and I'll post the other video to this This is more testing on the ASSA high security Stanley padlock that we make. Basically we take the standard stocked Stanley 24-7 padlock, this thing you can find stock without the high security core online for anywhere from $30 to $50. We take it, pull out the pickable core and replace it with a high security non-pickable core, basically an ASA Twin Combi Twin 6000 that has extra drill protection. So the lock already has drill protection here. It has a spinning plate for drill protection. It also has drill protection i"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "as extra drill protection. So the lock already has drill protection here. It has a spinning plate for drill protection. It also has drill protection in the pins as well. So even if you try and use a small drill bit and go in between the drill antenna, drill plate you're still going to get deflected off both the sidebar and the pins so neither one of those techniques is going to work very well um you know we've completely destroyed our our uh 36 inch hk porter bolt cutters you can see we've tried to cut this many many times every time it just completely destroys the jaws of it um you know we've destroyed the jaws of these trying trying to cut the chain. So we know the chain cannot be cut. It just really wreaks havoc on pretty much everything. So basically the way this lock really works is because we have these 12 millimeter links of chain, both of these locked in this together is going to"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": ". So basically the way this lock really works is because we have these 12 millimeter links of chain, both of these locked in this together is going to create almost no room to get bolt cutters in and then we're going to have the shackle shroud for protection. So basically I'm just going to kind of stuff this in here and we'll see if our brand new brand spanking new 42 inch bolt cutters with an additional ratchet strap that allows for maximum torque. So it's not going to matter whether it's a 300 pound man, a 400 pound man, or a 100 pound person operating these. going to go ahead and provide the same amount of pressure. I want to cut the excess off this off so it doesn't fill up quite so fast. Apparently I need to sharpen my pocket knife too. I going to take too much off There we go. There we go. I can't put any more pressure on this literally this is as fixed as it can be I mean you real"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": ". I going to take too much off There we go. There we go. I can't put any more pressure on this literally this is as fixed as it can be I mean you really can't put any more pressure than that on there a man would never be able to exert this kind of force on this so release it Let's see if we get any damage. We've got a little booger bite right there and a little dig right there, but it is still completely intact. You don't have to buy a tip, but because of the way this is set up, you're only going get that tiny little bit in there. You can see because the chain actually blocks it from getting in there. So that's all the further we're going to be able to get on that and that is not going to give us very much leverage. All right and round two. Oh oh Good good That it I mean that's all we're getting. That's strung as tight as a banjo. And we are not cutting anything. So once again we've got "
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " Oh oh Good good That it I mean that's all we're getting. That's strung as tight as a banjo. And we are not cutting anything. So once again we've got a little bite on the shackle but we have no break or compromise. We'll go ahead and put a link in here. test the chain out with these bigger bolt cutters. I'm afraid that's it. So, applying way more tension, I mean, just look at this thing. It's just as tight as you're going to get it. You still have no compromise, no breakage of the locking system or the chain. Once again, there's a bite mark that you can't even hardly tell, really. I mean it just crazy how tough this stuff is And then let come back here and let look at what it did to the bolt cutter jaws You can see that it just completely destroys them We'll go one step further. We'll try it with the hydraulic bolt cutters too. I'll put brand new cutters in here as you can see. I'll load"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "estroys them We'll go one step further. We'll try it with the hydraulic bolt cutters too. I'll put brand new cutters in here as you can see. I'll load them up and then come back. Alrighty so we got our brand new jaws loaded up in our cutter here and we'll go ahead and tighten that up and try and cut this. See where I can get it. Let's see. Control right here. See how the chain, even in the way, prevents me from getting a good bite on this. And already we're just trashing our boat covers. You can see it's harder than the steel. just completely breaks them. So there you go guys, there's your hydraulic bolt cutters. They still don't work. It just destroys the jaws and it's still here. Now the chain is the same way. On for the chain. No, please don't trust me, okay? I got your pics, he stayed in the room. You took the pic tovolwo me too, then how come? Because. You've walked around with a be"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " don't trust me, okay? I got your pics, he stayed in the room. You took the pic tovolwo me too, then how come? Because. You've walked around with a beard. Okay, I'm going to distract her. Anna Trектor! And again, you can just hear it breaking off. Put the helmet down. See, every time it just continues to break. Come on, give it back. Come on, give it back. the jaws of the bolt cutters. You can see where it's broke even more now. So, I mean, we've got the biggest set of bolt cutters that we can really have access to. We've got hydraulic bolt cutters. You know, we've tried it in here. I'll try and edit, I'll try and bring that video into here too. We can try and use this. There you go. I'm gonna put something over this because I don't want anything to break and fly away so this is the same result we got with the chain to where we're just pumping but every time we pump this. It's just fluid"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "ything to break and fly away so this is the same result we got with the chain to where we're just pumping but every time we pump this. It's just fluid going back, bypassing the jack. It's actually not going any further. It simply destroying the bolt cutters It breaking that hardened jaw You can see where the weld is starting to break in there You can see I can do this but we not gaining anything by doing so The fluid is just bypassing into itself. You can hear it. all right so yes that did the most damage and look it takes this gigantic you know 50 75 pound machine and we do finally have a little bit of cracking right here but it still does not cut the shackle so you know i don't know what more we can say go ahead put a link of chain in there. I think we've already done this one, but we'll go ahead and do it again just to show you exactly what we're talking about here. Let's see, where L"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "re. I think we've already done this one, but we'll go ahead and do it again just to show you exactly what we're talking about here. Let's see, where Let's see, where am I gonna put this? Nothing. I can hear the fluid starting to bypass again, and we're getting nothing. so you can hear it bypass it over and over and over again we're not going to get any further than that um you know that's the power of this this particular setup i mean if we put that in there you're just gonna be pushing against the chain. You know, it's not, it's still not gonna help. See, it just slips right out. So, bolt cover, every kind and size different brands from the best made ones the largest made you know industrial ones hydraulic hydraulic Let's just call it, folks. This chain and padlock cannot be cut with bolt cutters. There's only one way that you're getting into this chain, and that's with an angle grinder"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "ks. This chain and padlock cannot be cut with bolt cutters. There's only one way that you're getting into this chain, and that's with an angle grinder. You know, we'll show you a couple more things too, as far as the anti-drill features. You know, we'll put this lock right here and I'll see if we can get the camera to pick it up. and well this is a TTP cobalt bit these are the hardest steel cobalt bits you can buy basically and you know I've had people ask well can you drill this no we can't drill through the pin to release this. It's just too hard and round. So we can't drill through that. This is what this is going to do. this is working exactly how it's supposed to. It's going to mess up your drill point to the point where if your bit does catch, it's just going to try and break it. even if we pull that out still that put it in such a bind that it pulled out the the drill plate here a"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "es catch, it's just going to try and break it. even if we pull that out still that put it in such a bind that it pulled out the the drill plate here and even if we do that where we need to drill this lock out we still not going anywhere you know why because there an inserted pin in here that hardened steel that will not come out It going to deflect this drill bit Not going anywhere. And to show that this drill bit is a good drill bit, Let's see here. Got a chunk of steel right here. Same drill bit. Drills just fine, all day long, nice big coily spools. So drill attacks are not going to work. The lock has its own defenses against the drill attack with that plate, and even if that plate is completely bound and compromised, the lock cylinder itself, this is where the high security ASSA upgrade comes in handy. if that cylinder did not have that after the spinny plate came out then you would "
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "tself, this is where the high security ASSA upgrade comes in handy. if that cylinder did not have that after the spinny plate came out then you would be able to drill the cylinder but not with the ASSA high-security setup there's inserted pins in there that are hardened steel that are designed to continue to protect the lock even when the exterior protection is gone and we just demonstrated that we use the hardest cobalt bits these are Rockwell hardness scale 66 on the on the Rockwell hardness scale they're the hardest best cobalt bits I've ever used and I use them to drill all kinds of steel hardened steel stainless steel and they still will not drill through that lock so the only way you're getting in ladies and gentlemen is the angle grinder and mind you after all this attacking, I'm betting, look at that. It's still going to work. It's still going to protect your stuff. Your stuff wi"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "nder and mind you after all this attacking, I'm betting, look at that. It's still going to work. It's still going to protect your stuff. Your stuff will still be there in the morning. And it's still even working, even after all this attacking. The only way we're getting in this lock is with our angle grinder. And a lot of people come I'm going to explain about how we did that last time. So I'm going to leave it loose, just like this. We'll cut the chain, and then we'll cut the padlock itself. All right. See how long that takes? That's how long it's going to take to do this. Now I'm going to lock it back up. I'll show you how long it takes to cut the lock. Still works by the way, even after all this other nonsense. You know we can hammer I don know if I have a bigger hammer Somewhere. We're not satisfied that this is still one of the most durable locks that you can buy. I can't think of a"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "on know if I have a bigger hammer Somewhere. We're not satisfied that this is still one of the most durable locks that you can buy. I can't think of anything else that's going to put up with this kind of pressure and still open up. And we'll tie this up again. I'm keeping this thing on with the club here we go I'm going to go ahead and start the engine. So, worst case scenario, somehow, someday, somebody finds a pair of bolt cutters that can cut this Even if you cut it here you still can get the stuff out So you seen how much work it takes to get this open to this point and you seen how much work it takes to try and use force with bolt cutters or shearing action. You know, maybe they make a 57 inch bolt cutters. Even if you cut that, which is still going to be difficult, you still can't get it off. You've used your only point here where you could actually even get anything to cut in ther"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "is still going to be difficult, you still can't get it off. You've used your only point here where you could actually even get anything to cut in there. Even with the angle grinder this is going to force you to make another cut. We cannot simply twist that out of there. It's still protected and if I put the key in here it would still work. So we're gonna have to cut one more side. my goodness people that's what it's going to take to get this open um so you know choose your security wisely and even after all that the cylinder still actually works. So check it out. Check out tricountylocksmithservice.com. Find the picture of the Ossilock. Click on it. Pay for your security. You get what you pay for. You can buy Master Locks all day long at the hardware store, but this is what you're going to get. This is what you're going to get with a custom-made, professionally designed product. It's goi"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "e hardware store, but this is what you're going to get. This is what you're going to get with a custom-made, professionally designed product. It's going to address the most common and even uncommon types of attack. Bolt cutters, drilling, hacksaw. We've done hacksaw before. It just completely dulls the blade The steel in the chain and the lock is harder than the steel in the sawzall blade Hacksaw any of that kind of stuff bolt cutters hydraulic bolt cutters industrial gigantic bolt cutters that are at hardware stores it survives it all The only thing that's not going to survive is an angle grinder, but there isn't a product on the market today that can survive the angle grinder or a cutting torch. Those are the two things that that are the end all but this makes a lot of noise You saw how long it took to cut this most of these Only this one has actually enough juice to make those cuts in"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "end all but this makes a lot of noise You saw how long it took to cut this most of these Only this one has actually enough juice to make those cuts in fact Your your lighter gauge ones, you know, some of the DeWalt ones and stuff like that They won't even make the cut the battery will die before they get the cut made. So you've seen it all here I can't do any more testing than this. I mean What else is there so for more information check out the website below pick one up today secure your bike Anything you have motorcycle moped generators trailers You know this is gonna work on just better. Thanks for watching Hey, what's going on out there guys? I just want to share an update from the Stanley Assa high security hybrid lock cylinder that we put here this lock was actually really sent out to a customer and it was sent out to a customer and it actually had within within a week or two actua"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " put here this lock was actually really sent out to a customer and it was sent out to a customer and it actually had within within a week or two actually physically had an attack done on it. And the customer contacted me and I thought it was pretty cool that this thing was actually out in the field by real people in a real, you know, security situation. And this is what happened. You can see the bite marks on here. but you can see several different ones, but they didn't get the stuff. They didn't get, I think it was a bike or a scooter or something. He locked up with this. They didn't get it. They couldn't pick it. They couldn't, you know, they didn't do anything to the lock cylinder. You know you can't pick these, or I mean, you know, yes, yes, people that have had the lock cylinder and Nasa lock cylinder for months and months and months and picked and worked on it and was able to take "
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " yes, people that have had the lock cylinder and Nasa lock cylinder for months and months and months and picked and worked on it and was able to take it apart and Pick it slowly one by one and put it back together and add pins to it and had that kind of access to it Yes, you will see maybe one or two of those videos out there, but in a real life situation situation nobody's picking these things it's just not going to happen and the the paywag chain saved this now the reason this lock system works is because the two links take up so much room it's the maximum that would be allowed to fit in there and we've already gone over the security chain we know that it's harder than the jaws of the bolt cutters and it usually damages the bolt cutters when you try and cut this paywag security hardened security chain so really the the only other attack points on this would be the lock itself it's got "
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "hen you try and cut this paywag security hardened security chain so really the the only other attack points on this would be the lock itself it's got the anti drill feature the anti drill plate here Asa has stainless steel inserts and stainless steel pins so you're not going to be drilling this thing out and the bulk cutter resistance you know this is living proof right here yes if you get a super gigantic pair of you know bolt cutters or hydraulic ones or battery powered ones or something like that yeah you could probably maybe get this but the reason it really works is because the way the chain is actually takes up all the space in the void okay so if we have where my smaller bolt cutters I just had them We've got some little bolt cutters like these right here. Okay. We'll put these in here so the smaller jaws will fit down in there to where you can get a bite on it. But there's not ve"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " like these right here. Okay. We'll put these in here so the smaller jaws will fit down in there to where you can get a bite on it. But there's not very much room. There's a little bit, but not very much at all. These will go down in there, but they're obviously not going to cut this in no freaking way. Not even close. They're not big enough. I mean I can put all the leverage we want on that, we're not cutting it, it didn't even make a dent in it. Okay, so that's a 14 inch pair. Here's a little bit bigger pair right here. These go on here as well. But once again, we're not letting it have very much room to work. And the shackle shroud is protecting the rest of the shackle down here. So the only three places that we can try and get on this is here right smack dab in the middle but it just not letting it go in there very well So if we can't get a bite on it to get some leverage on it, we'r"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "s here right smack dab in the middle but it just not letting it go in there very well So if we can't get a bite on it to get some leverage on it, we're not going to be able to cut it. you know and this is prime situation where I can actually use the ground to stand on this thing and try and cut it and you know if it's on a bike or it's up it's on a gate you're not going to be able to get that leverage you're going to be trying to create that leverage grabbing it this way and it's just not happening you can see again I mean we're not doing anything to this And then as we go up in bolt cutter size, well now the jaws are much thicker. You know, so it's actually, you're going to get even less on there. So yes, these are bigger bolt cutters, but you know, you're just not really going to get a bite on it. Let's see here. Move around a little bit more here. I mean there's just not very much roo"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " you know, you're just not really going to get a bite on it. Let's see here. Move around a little bit more here. I mean there's just not very much room for this thing to work. So even with these out here, I mean, you know, we can still stand on this stuff all day long. And this is prime, you know, conditions where I can stand on this. You're not going to have that if it's up above or bolted to something to where, you know, it's attached to a gate where you're not going to be able to get that kind of leverage and jump up and down on it. I can't get it in the back back here and really crank down on it. Now, yes, if you take the chain off of this and you take this block and you put it in a big giant set of heavy-duty bolt cutters, yeah, you can cut the shackle. You can work at it and cut the shackle. But because of the way that it's set up, designed with the security chain that fills up the"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "n cut the shackle. You can work at it and cut the shackle. But because of the way that it's set up, designed with the security chain that fills up the void, you just don have any space to work And the shackle shroud protects the rest of it so you know i mean we can try cutting the shroud too i mean that the best bite you gonna get on this thing right here and even that's not really doing anything you know so that's what makes this work as a pattern so for more information check out the website below we We do make these. We do the standard security lock right here. It's a pretty good lock by itself, but it is susceptible to some picking attacks or somebody could remake your key at the hardware store. That key is copyable. And then we have the ASA high security cylinder as well. The ASA high security cylinder, there's no... You can't copy this key, you're not gonna be picking the lock, you"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "e ASA high security cylinder as well. The ASA high security cylinder, there's no... You can't copy this key, you're not gonna be picking the lock, you're not gonna be doing anything like that, and nobody can copy your key. So for more information, check out the website below. Hey, what's going on there? This is Wayne, and we're looking at the Paywag. This is the Paywag chain review. Paywag hardened square link chain. This chain was designed for heavy equipment tire chains. So this was traction chain, and the chain used to wear out quickly and then break. So they came up with an ultra, ultra hard chain at a Rockwell hardness scale rating of 63 on this stuff. And it is completely awesome. I have not found a harder chain yet on the market at all. This stuff is absolutely scary to cut. it's chipped my bolt cutters both times I've attempted to cut it. You can see here, if we look at that, tha"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "ll. This stuff is absolutely scary to cut. it's chipped my bolt cutters both times I've attempted to cut it. You can see here, if we look at that, that this chipping and flattening, it's actually, the chain is harder than the steel and the bolt cutters. The bolt cutters are only probably about a 60, 62 rock wool hardness scale rating. And when you put a lot of weighted force on that fine edge, it cracks and it chips and it goes flying. And it's ridiculous to try and cut this stuff really, because it's dangerous. You're gonna catch shrapnel and you're not gonna do anything anyways. I jumped up and down on this stuff and you can even tell a mark where that was going on So this is hands down the hardest chain that I seen or done any testing on We've frozen it with the canned air right here and hit it with a big hammer to no avail. It's not so hard that it becomes brittle. It's got alloy in "
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " We've frozen it with the canned air right here and hit it with a big hammer to no avail. It's not so hard that it becomes brittle. It's got alloy in it, so it's got some other alloys that help everything bond together and hold together and stay together. So that did not work on it as an attack method. The Sawzall right here just flattens the teeth completely flat. Not even a scratch on there, barely even takes the outer coating paint off of there. Angle grinder. Angle grinder, nothing gets by the angle grinder. So it but it did Compare it to a normal piece of hardware store chain this takes about 10 to 15 seconds to cut through with an angle grinder like So to make two cuts This stuff took two minutes Takes one minute to make one cut and another minute to make another cut in prime ideal conditions where I can lock it in a vise And go ahead and Cut on this stuff That's the other thing al"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "nother minute to make another cut in prime ideal conditions where I can lock it in a vise And go ahead and Cut on this stuff That's the other thing all this testing is done in ideal conditions to benefit me to defeat the chain Concrete floor giant bolt cutters that are you know super super sharp and maintained high quality stuff I can put it in the bolt cutter or I can put it in the vise and cut it on it And the grinder and everything else And this is loose and flimsy like so and you're trying to cut on it with your angle grinder very thin fine blade, it becomes stuck and caught. And if it pinches, it'll disintegrate. It'll blow apart and it'll send shrapnel towards your face and everywhere else. If the chain link catches, it can get caught in there. There's just a lot of things that can go wrong if you don't have it in the ideal conditions. I'm pretty sure we did this before, but I don'"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " in there. There's just a lot of things that can go wrong if you don't have it in the ideal conditions. I'm pretty sure we did this before, but I don't think I got it on camera. So We'll just go ahead and try this. And I'll go ahead and show here that the teeth are pretty much worn off of there now. So that means that this is much harder than the steel that that came out of. And you can see It didn't even do anything. Maybe a little scratch on the paint there. So that's definitely not going to work. Angle grinder did, but look at how long it took and look at how loud and noisy it was. You know, you're never going to stop anything completely, but that is, this chain is just going to cause the most amount of difficulty for a burglar to take your stuff. If you're going to invest in a good lock, invest in a good chain too. This is Wayne with Tri-County Locksmith Service. For more information"
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": "our stuff. If you're going to invest in a good lock, invest in a good chain too. This is Wayne with Tri-County Locksmith Service. For more information, go to www.Tri-CountyLocksmithService.com. Thanks. Alrighty guys, this is the end of the video. When you watch YouTube here, a couple ways you can really help me out is to go ahead and make sure that you subscribe. Click on the subscribe button right there. and then come down here and share this video with Facebook and Twitter and any of the other social media facets that you are a part of. This helps other people find my videos. It helps my videos gain count and gain the accountability and views and that in turn helps me provide more videos to you with good information about security and the latest in technology today. So Facebook, Twitter, Google Plus are about the biggest ones. Those are the ones that help out the most and just posting "
  },
  {
    "video_id": "FQkoEj9GLtU",
    "title": "Best Lock For a Trailer Camper RV Security Chain Can't Be Cut With Bolt Cutters Pick Proof",
    "text": " latest in technology today. So Facebook, Twitter, Google Plus are about the biggest ones. Those are the ones that help out the most and just posting those on there lets your, it spreads that information to your friends, family, anybody else that would be interested in watching one of these videos and it helps me get the countage I need to be able to continue to make videos and provide the information to you. So this helps out a lot. Thanks a lot. Have a great day."
  }
]